In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as pyplot
from sklearn import linear_model

In [88]:
df=pd.read_csv('hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [89]:
df.isna().sum()

experience                    2
test_score(out of 10)         1
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [90]:
df[df.isna().any(axis=1)]

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
6        ten                    NaN                           7      72000

In [91]:
df.rename(columns={'test_score(out of 10)':'test_score','interview_score(out of 10)':'interview_score','salary($)':'salary'},inplace=True)

In [92]:
df.experience=df.experience.fillna("zero")
df.test_score=df.test_score.fillna(df.test_score.mean())
df[df.isna().any(axis=1)]

Empty DataFrame
Columns: [experience, test_score, interview_score, salary]
Index: []

In [94]:
from word2number import w2n
df.experience=df.experience.apply(w2n.word_to_num)

In [95]:
model=linear_model.LinearRegression()
model.fit(df[['experience', 'test_score', 'interview_score']],df.salary)

LinearRegression()

In [96]:
model.predict([[12,10,10]])

array([92268.07227784])

In [97]:
model.predict([[2,9,6]])

array([53290.89255945])